monte-monte/ch32v003fun/ch32fun/ch5xxhw.h
#ifndef TODO_HARDWARE_H
#define TODO_HARDWARE_H

#include "ch32fun.h"

#define CH5xx
#if defined(CH57x) && (MCU_PACKAGE == 0 || MCU_PACKAGE == 2)
#define CH570_CH572
#elif defined(CH57x) && (MCU_PACKAGE == 1 || MCU_PACKAGE == 3)
#define CH571_CH573
#elif defined(CH58x) && (MCU_PACKAGE == 2 || MCU_PACKAGE == 3)
#define CH582_CH583
#elif defined(CH58x) && (MCU_PACKAGE == 4 || MCU_PACKAGE == 5)
#define CH584_CH585
#elif defined(CH59x) && (MCU_PACKAGE == 1 || MCU_PACKAGE == 2)
#define CH591_CH592
#endif

#ifndef __ASSEMBLER__  // Things before this can be used in assembly.

#ifdef __cplusplus
extern "C" {
#endif

/* Interrupt Number Definition, according to the selected device */
typedef enum IRQn
{
	/******  RISC-V Processor Exceptions Numbers *******************************************************/
	NonMaskableInt_IRQn = 2, /* 2 Non Maskable Interrupt                             */
	EXC_IRQn = 3,            /* 3 Exception Interrupt                                */
	Ecall_M_Mode_IRQn = 5,   /* 5 Ecall M Mode Interrupt                             */
	Ecall_U_Mode_IRQn = 8,   /* 8 Ecall U Mode Interrupt                             */
	Break_Point_IRQn = 9,    /* 9 Break Point Interrupt                              */
	SysTick_IRQn = 12,       /* 12 System timer Interrupt                            */
	Software_IRQn = 14,      /* 14 software Interrupt                                */

	/******  RISC-V specific Interrupt Numbers *********************************************************/
	TMR0_IRQn = 16,          /* TMR0 */
	GPIOA_IRQn = 17,         /* GPIOA */
	GPIOB_IRQn = 18,         /* GPIOB */
	SPI0_IRQn = 19,          /* SPI0 */
	BB_IRQn = 20,            /* BLEB */
	LLE_IRQn = 21,           /* BLEL */
	USB_IRQn = 22,           /* USB */
	USB2_IRQn = 23,          /* USB2 */
	TMR1_IRQn = 24,          /* TMR1 */
	TMR2_IRQn = 25,          /* TMR2 */
	UART0_IRQn = 26,         /* UART0 */
	UART1_IRQn = 27,         /* UART1 */
	RTC_IRQn = 28,           /* RTC */
	ADC_IRQn = 29,           /* CMP */
	I2C_IRQn = 30,           /* I2C */
	PWMX_IRQn = 31,          /* PWMX */
	TMR3_IRQn = 32,          /* TMR3 */
	UART2_IRQn = 33,         /* UART2 / KEYSCAN */
	UART3_IRQn = 34,         /* UART3 / ENCODER */
	WDOG_BAT_IRQn = 35,      /* WDOG_BAT */
} IRQn_Type;

#ifdef CH570_CH572
#define TMR_IRQn TMR1_IRQn
#define SPI_IRQn SPI0_IRQn
#define UART_IRQn UART1_IRQn
#define CMP_IRQn ADC_IRQn
#define KEYSCAN_IRQn UART2_IRQn
#define ENCODER_IRQn UART3_IRQn
#endif

#ifdef CH571_CH573
#define WORD_OR_JUMP "j"
#else
#define WORD_OR_JUMP ".word"
#endif

#define BASE_VECTOR "\n"\
	".balign  2\n"\
	".option   push;\n"\
	".option   norvc;\n"\
	ISR_HANDLER_INITIAL_JUMP \
	".word   0\n"\
	WORD_OR_JUMP " NMI_Handler                /* NMI Handler */\n"\
	WORD_OR_JUMP " HardFault_Handler          /* Hard Fault Handler */\n"\
	".word         0xF3F9BDA9\n"\
	WORD_OR_JUMP " Ecall_M_Mode_Handler       /* 5 */\n"\
	".word         0\n"\
	".word         0\n"\
	WORD_OR_JUMP " Ecall_U_Mode_Handler       /* 8 */\n"\
	WORD_OR_JUMP " Break_Point_Handler        /* 9 */\n"\
	".word         0\n"\
	".word         0\n"\
	WORD_OR_JUMP " SysTick_Handler            /* SysTick Handler */\n"\
	".word         0\n"\
	WORD_OR_JUMP " SW_Handler                 /* SW Handler */\n"\
	".word         0\n"\
	"/* External Interrupts */\n"\
	WORD_OR_JUMP " TMR0_IRQHandler            /* 16: TMR0 */\n"\
	WORD_OR_JUMP " GPIOA_IRQHandler           /* GPIOA */\n"\
	WORD_OR_JUMP " GPIOB_IRQHandler           /* GPIOB */\n"\
	WORD_OR_JUMP " SPI0_IRQHandler            /* SPI0 */\n"\
	WORD_OR_JUMP " BB_IRQHandler              /* BLEB */\n"\
	WORD_OR_JUMP " LLE_IRQHandler             /* BLEL */\n"\
	WORD_OR_JUMP " USB_IRQHandler             /* USB */\n"\
	".word         0 \n"\
	WORD_OR_JUMP " TMR1_IRQHandler            /* TMR1 */\n"\
	WORD_OR_JUMP " TMR2_IRQHandler            /* TMR2 */\n"\
	WORD_OR_JUMP " UART0_IRQHandler           /* UART0 */\n"\
	WORD_OR_JUMP " UART1_IRQHandler           /* UART1 */\n"\
	WORD_OR_JUMP " RTC_IRQHandler             /* RTC */\n"\
	WORD_OR_JUMP " ADC_IRQHandler             /* ADC */\n"\
	WORD_OR_JUMP " I2C_IRQHandler             /* I2C */\n"\
	WORD_OR_JUMP " PWMX_IRQHandler            /* PWMX */\n"\
	WORD_OR_JUMP " TMR3_IRQHandler            /* TMR3 */\n"\
	WORD_OR_JUMP " UART2_IRQHandler           /* UART2 / KEYSCAN */\n"\
	WORD_OR_JUMP " UART3_IRQHandler           /* UART3 / ENCODER */\n"\
	WORD_OR_JUMP " WDOG_BAT_IRQHandler        /* WDOG_BAT */\n"

#ifdef CH570_CH572
#define TMR_IRQHandler TMR1_IRQHandler
#define SPI_IRQHandler SPI0_IRQHandler
#define UART_IRQHandler UART1_IRQHandler
#define CMP_IRQHandler ADC_IRQHandler
#define KEYSCAN_IRQHandler UART2_IRQHandler
#define ENCODER_IRQHandler UART3_IRQHandler
#endif
#define DEFAULT_INTERRUPT_VECTOR_CONTENTS BASE_VECTOR "\n.option pop;\n"

#define __HIGH_CODE __attribute__((section(".highcode"), used))
#define __INTERRUPT __attribute__((interrupt))


/* memory mapped structure for SysTick */
typedef struct __attribute__((packed))
{
#ifdef CH570_CH572
	__IO uint32_t CTLR;
	__IO uint32_t SR;
	union
	{
		__IO uint32_t CNT;
		__IO uint32_t CNTL;
	};
	uint8_t RESERVED[4];
	union
	{
		__IO uint32_t CMP;
		__IO uint32_t CMPL;
	};
	uint8_t RESERVED0[4];
#elif defined(CH571_CH573)
	__IO uint32_t CTLR;
	__IO uint64_t CNT;
	__IO uint64_t CMP;
	__IO uint32_t CNTFG;
#else
	__IO uint32_t CTLR;
	__IO uint32_t SR;
	__IO uint64_t CNT;
	__IO uint64_t CMP;
#endif
} SysTick_Type;

/* memory mapped structure for Program Fast Interrupt Controller (PFIC) */
typedef struct
{
	__I uint32_t  ISR[8];           // 0
	__I uint32_t  IPR[8];           // 20H
	__IO uint32_t ITHRESDR;         // 40H
	__IO uint32_t FIBADDRR;         // 44H
	__O uint32_t  CFGR;             // 48H
	__I uint32_t  GISR;             // 4CH
	__IO uint8_t  VTFIDR[4];        // 50H (IDCFGR on ch582)
	uint8_t       RESERVED0[0x0C];  // 54H
	__IO uint32_t VTFADDR[4];       // 60H (FIADDRR on ch582)
	uint8_t       RESERVED1[0x90];  // 70H
	__O uint32_t  IENR[8];          // 100H
	uint8_t       RESERVED2[0x60];  // 120H
	__O uint32_t  IRER[8];          // 180H
	uint8_t       RESERVED3[0x60];  // 1A0H
	__O uint32_t  IPSR[8];          // 200H
	uint8_t       RESERVED4[0x60];  // 220H
	__O uint32_t  IPRR[8];          // 280H
	uint8_t       RESERVED5[0x60];  // 2A0H
	__IO uint32_t IACTR[8];         // 300H
	uint8_t       RESERVED6[0xE0];  // 320H
	__IO uint8_t  IPRIOR[256];      // 400H
	uint8_t       RESERVED7[0x810]; // 500H
	__IO uint32_t SCTLR;            // D10H
} PFIC_Type;
#endif /* __ASSEMBLER__*/

#ifdef __ASSEMBLER__
#define CORE_PERIPH_BASE           (0xE0000000) /* System peripherals base address in the alias region */
#else
#define CORE_PERIPH_BASE           ((uint32_t)(0xE0000000))
#endif /* __ASSEMBLER__*/

#define PFIC_BASE                  (CORE_PERIPH_BASE + 0xE000)
#define SysTick_BASE               (CORE_PERIPH_BASE + 0xF000)

#define PFIC                       ((PFIC_Type *) PFIC_BASE)
#define NVIC                       PFIC
#define NVIC_KEY1                  ((uint32_t)0xFA050000)
#define NVIC_KEY2                  ((uint32_t)0xBCAF0000)
#define NVIC_KEY3                  ((uint32_t)0xBEEF0000)

