monte-monte/ch32v003fun/ch32fun/ch5xxhw.h
#define SysTick                    ((SysTick_Type *) SysTick_BASE)
#define SYSTICK_LOAD_RELOAD_MSK    (0xFFFFFFFFFFFFFFFF)
#define SYSTICK_CTLR_SWIE          (1 << 31)
#define SYSTICK_CTLR_INIT          (1 << 5)
#define SYSTICK_CTLR_MODE          (1 << 4)
#define SYSTICK_CTLR_STRE          (1 << 3)
#define SYSTICK_CTLR_STCLK         (1 << 2)
#define SYSTICK_CTLR_STIE          (1 << 1)
#define SYSTICK_CTLR_STE           (1 << 0)
#define SYSTICK_SR_CNTIF           (1 << 0)

typedef enum
{
#ifdef CH570_CH572
	CLK_SOURCE_LSI = 0xC0,

	CLK_SOURCE_HSE_16MHz = (0x02),
	CLK_SOURCE_HSE_8MHz = (0x04),
	CLK_SOURCE_HSE_6_4MHz = (0x05),
	CLK_SOURCE_HSE_4MHz = (0x08),
	CLK_SOURCE_HSE_2MHz = (0x10),
	CLK_SOURCE_HSE_1MHz = (0x0),

	CLK_SOURCE_PLL_100MHz = (0x40 | 6),
	CLK_SOURCE_PLL_75MHz = (0x40 | 8),
	CLK_SOURCE_PLL_60MHz = (0x40 | 10),
	CLK_SOURCE_PLL_50MHz = (0x40 | 12),
	CLK_SOURCE_PLL_40MHz = (0x40 | 15),
	CLK_SOURCE_PLL_30MHz = (0x40 | 20),
	CLK_SOURCE_PLL_25MHz = (0x40 | 24),
	CLK_SOURCE_PLL_24MHz = (0x40 | 25),
	CLK_SOURCE_PLL_20MHz = (0x40 | 30),
#elif defined(CH571_CH573)
	CLK_SOURCE_LSI = 0x00,
	CLK_SOURCE_LSE,

	CLK_SOURCE_HSE_8MHz = 0x24,
	CLK_SOURCE_HSE_6_4MHz = 0x25,
	CLK_SOURCE_HSE_4MHz = 0x28,
	CLK_SOURCE_HSE_2MHz = (0x20 | 16),
	CLK_SOURCE_HSE_1MHz = (0x20 | 0),

	CLK_SOURCE_PLL_60MHz = 0x48,
	CLK_SOURCE_PLL_48MHz = (0x40 | 10),
	CLK_SOURCE_PLL_40MHz = (0x40 | 12),
	CLK_SOURCE_PLL_36_9MHz = (0x40 | 13),
	CLK_SOURCE_PLL_32MHz = (0x40 | 15),
	CLK_SOURCE_PLL_30MHz = (0x40 | 16),
	CLK_SOURCE_PLL_24MHz = (0x40 | 20),
	CLK_SOURCE_PLL_20MHz = (0x40 | 24),
	CLK_SOURCE_PLL_15MHz = (0x40 | 0),
#elif defined(CH582_CH583)
	CLK_SOURCE_LSI = 0x00,
	CLK_SOURCE_LSE,

	CLK_SOURCE_HSE_16MHz = 0x22,
	CLK_SOURCE_HSE_8MHz = 0x24,
	CLK_SOURCE_HSE_6_4MHz = 0x25,
	CLK_SOURCE_HSE_4MHz = 0x28,
	CLK_SOURCE_HSE_2MHz = (0x20 | 16),
	CLK_SOURCE_HSE_1MHz = (0x20 | 0),

	CLK_SOURCE_PLL_80MHz = 0x46,
	CLK_SOURCE_PLL_60MHz = 0x48,
	CLK_SOURCE_PLL_48MHz = (0x40 | 10),
	CLK_SOURCE_PLL_40MHz = (0x40 | 12),
	CLK_SOURCE_PLL_36_9MHz = (0x40 | 13),
	CLK_SOURCE_PLL_32MHz = (0x40 | 15),
	CLK_SOURCE_PLL_30MHz = (0x40 | 16),
	CLK_SOURCE_PLL_24MHz = (0x40 | 20),
	CLK_SOURCE_PLL_20MHz = (0x40 | 24),
	CLK_SOURCE_PLL_15MHz = (0x40 | 0),
#elif defined(CH584_CH585)
	CLK_SOURCE_32KHz = 0xC0,

	CLK_SOURCE_HSI_16MHz = (0x100 | 0x80),
	CLK_SOURCE_HSI_8MHz = 0x02,
	CLK_SOURCE_HSI_5_3MHz = 0x03,
	CLK_SOURCE_HSI_4MHz = 0x04,
	CLK_SOURCE_HSI_2MHz = 0x08,
	CLK_SOURCE_HSI_1MHz = 0x10,

	CLK_SOURCE_HSE_32MHz = (0x100 | 0x200 | 0x80),
	CLK_SOURCE_HSE_16MHz = (0x200 | 0x02),
	CLK_SOURCE_HSE_8MHz = (0x200 | 0x04),
	CLK_SOURCE_HSE_6_4MHz = (0x200 | 0x05),
	CLK_SOURCE_HSE_4MHz = (0x200 | 0x08),
	CLK_SOURCE_HSE_2MHz = (0x200 | 0x10),

	CLK_SOURCE_HSI_PLL_78MHz = (0x100 | 0x40 | 4),
	CLK_SOURCE_HSI_PLL_62_4MHz = (0x100 | 0x40 | 5),
	CLK_SOURCE_HSI_PLL_52MHz = (0x100 | 0x40 | 6),
	CLK_SOURCE_HSI_PLL_39MHz = (0x100 | 0x40 | 8),
	CLK_SOURCE_HSI_PLL_26MHz = (0x100 | 0x40 | 12),
	CLK_SOURCE_HSI_PLL_24MHz = (0x100 | 0x40 | 13),
	CLK_SOURCE_HSI_PLL_19_5MHz = (0x100 | 0x40 | 16),
	CLK_SOURCE_HSI_PLL_13MHz = (0x100 | 0x40 | 24),

	CLK_SOURCE_HSE_PLL_78MHz = (0x300 | 0x40 | 4),
	CLK_SOURCE_HSE_PLL_62_4MHz = (0x300 | 0x40 | 5),
	#define CLK_SOURCE_PLL_60MHz "This chip does not support an exact 60MHz setting. Please pick an availabe clock source from the SYS_CLKTypeDef struct in ch58xhw.h"
	CLK_SOURCE_HSE_PLL_52MHz = (0x300 | 0x40 | 6),
	CLK_SOURCE_HSE_PLL_39MHz = (0x300 | 0x40 | 8),
	CLK_SOURCE_HSE_PLL_26MHz = (0x300 | 0x40 | 12),
	CLK_SOURCE_HSE_PLL_24MHz = (0x300 | 0x40 | 13),
	CLK_SOURCE_HSE_PLL_19_5MHz = (0x300 | 0x40 | 16),
	CLK_SOURCE_HSE_PLL_13MHz = (0x300 | 0x40 | 24),
#elif defined(CH591_CH592)
	CLK_SOURCE_LSI = 0x00,
	CLK_SOURCE_LSE,

	CLK_SOURCE_HSE_16MHz =  (0x20 |  2),
	CLK_SOURCE_HSE_8MHz =   (0x20 |  4),
	CLK_SOURCE_HSE_6_4MHz = (0x20 |  5),
	CLK_SOURCE_HSE_4MHz =   (0x20 |  8),

	CLK_SOURCE_PLL_80MHz =  (0x40 |  6),
	CLK_SOURCE_PLL_60MHz =  (0x40 |  8),
	CLK_SOURCE_PLL_48MHz =  (0x40 | 10),
	CLK_SOURCE_PLL_32MHz =  (0x40 | 15),
	CLK_SOURCE_PLL_24MHz =  (0x40 | 20),
#endif
} SYS_CLKTypeDef;

// For debug writing to the debug interface, and USB ISP.
#ifdef CH570_CH572
#define DMDATA0 			((vu32*)0xe0000340)
#define DMDATA1 			((vu32*)0xe0000344)
#define DMSTATUS_SENTINEL	((vu32*)0xe0000348)       // Reads as 0x00000000 if debugger is attached.
#else
#define DMDATA0 			((vu32*)0xe0000380)
#define DMDATA1 			((vu32*)0xe0000384)
#define DMSTATUS_SENTINEL	((vu32*)0xe0000388)       // Reads as 0x00000000 if debugger is attached.
#endif

#ifdef CH570_CH572
#define ISPROM_ADDRESS                  0x0003c000
#define ISPROM_IN_RAM_ADDRESS           0x20000000
#define ISPROM_START_OFFSET             0xc0
#define ISPROM_SIZE                     0x2000
#define ISPROM_BOOTBUTTON_CHECK_ADDRESS 0x20000100
#define ISPROM_BSS_ADDRESS              0x20001ba0
#define ISPROM_BSS_SIZE                 0x0474
#define ISPROM_IN_RAM_GLOBALPOINTER     "0x20002398"  // string because it goes into asm()
#define ISPROM_IN_RAM_ENTRYPOINT        "0x20001196"  // string because it goes into asm()
#elif defined(CH582_CH583)
#define ISPROM_IN_RAM_ADDRESS           0x20003800
#define ISPROM_ADDRESS                  0x00078000
#define ISPROM_START_OFFSET             0xa4
#define ISPROM_SIZE                     0x2500
#define ISPROM_BOOTBUTTON_CHECK_ADDRESS 0x200038b0
#define ISPROM_GLOBALPOINTER            "0x20006410"  // string because it goes into asm()
#define ISPROM_ENTRYPOINT               "0x00078064"  // string because it goes into asm()
#elif defined(CH591_CH592)
#define ISPROM_ADDRESS                  0x00078000
#define ISPROM_IN_RAM_ADDRESS           0x20003800
#define ISPROM_START_OFFSET             0x94
#define ISPROM_SIZE                     0x2500
#define ISPROM_BOOTBUTTON_CHECK_ADDRESS 0x20003998
#define ISPROM_BSS_ADDRESS              0x20005cb8
#define ISPROM_BSS_SIZE                 0x0564
#define ISPROM_IN_RAM_GLOBALPOINTER     "0x200064b0" // string because it goes into asm()
#define ISPROM_IN_RAM_ENTRYPOINT        "0x20004e8a" // string because it goes into asm()
#endif

/* Independent watch-dog register */
#define R32_IWDG_KR         (*((vu32*)0x40001000))    // WO, watch-dog key register
#define R32_IWDG_CFG        (*((vu32*)0x40001004))    // RW, watch-dog configuration
#define  RB_RLR             0x0FFF                    // RW, watch-dog counter reload (write protect)
#define  RB_PR              0x7000                    // PR, prescale (write protect)
#define  RB_PVU             0x8000                    // RO, register update flag (write protect)
#define  RB_COUNT           0xFF0000                  // RO, watch-dog down counter
#define  RB_STOP_EN         0x20000000                // RW, watch-dog stop enable (write protect)
#define  RB_WR_PROTECT      0x40000000                // RO, write protect
#define  RB_IWDG_EN         0x80000000

/* System: clock configuration register */
#define R32_CLK_SYS_CFG     (*((vu32*)0x40001008))    // RWA, system clock configuration, SAM
#define R8_CLK_SYS_CFG      (*((vu8*)0x40001008))     // RWA, system clock configuration, SAM
#define  RB_CLK_SYS_MOD     0xC0                      // RWA, system clock source mode: 00/10=divided from 32MHz, 01=divided from PLL-600MHz,11=directly from LSI
#define  RB_CLK_PLL_DIV     0x1F                      // RWA, output clock divider from PLL or CK32M
#define  RB_TX_32M_PWR_EN   0x40000                   // RWA, extern 32MHz HSE power contorl
#define  RB_PLL_PWR_EN      0x100000                  // RWA, PLL power control
#define R8_HFCK_PWR_CTRL    (*((vu8*)0x4000100A))     // RWA, power configuration for system high clock, SAM
#define  RB_CLK_XT32M_PON   0x04                      // RWA, extern 32MHz HSE power contorl
#define  RB_CLK_XT32M_KEEP  0x08                      // RWA, RWA, disable auto closing when in halt mode
#define  RB_CLK_PLL_PON     0x10                      // RWA, PLL power control


