monte-monte/ch32v003fun/ch32fun/ch5xxhw.h
/* System: safe accessing register */
#define R32_SAFE_ACCESS     (*((vu32*)0x40001040))    // RW, safe accessing
#define R8_SAFE_ACCESS_SIG  (*((vu8*)0x40001040))     // WO, safe accessing sign register, must write SAFE_ACCESS_SIG1 then SAFE_ACCESS_SIG2 to enter safe accessing mode
#define  RB_SAFE_ACC_MODE   0x03                      // RO, current safe accessing mode: 11=safe/unlocked (SAM), other=locked (00..01..10..11)
#ifdef CH571_CH573
#define  RB_SAFE_ACC_ACT    0x08                      // RO, indicate safe accessing on
#define  RB_SAFE_ACC_TIMER  0x70                      // RO, safe accessing mode closed
#else
#define  RB_SAFE_ACC_ACT    0x04                      // RO, indicate safe accessing on
#define  RB_SAFE_ACC_TIMER  0xF8                      // RO, safe accessing mode closed
#endif
#define SAFE_ACCESS_SIG1    0x57                      // WO: safe accessing sign value step 1
#define SAFE_ACCESS_SIG2    0xA8                      // WO: safe accessing sign value step 2
#define SAFE_ACCESS_SIG0    0x00                      // WO: safe accessing sign value for disable
#define SYS_SAFE_ACCESS(a)  do { R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG1; \
								 R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG2; \
								 asm volatile ("nop\nnop"); \
								 {a} \
								 R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG0; \
								 asm volatile ("nop\nnop"); } while(0)

#define R8_CHIP_ID          (*((vu8*)0x40001041))     // RF, chip ID register
#define R8_SAFE_ACCESS_ID   (*((vu8*)0x40001042))     // RF, safe accessing ID register
#define R8_WDOG_COUNT       (*((vu8*)0x40001043))     // RW, watch-dog count, count by clock frequency Fsys/131072

/* System: global configuration register */
#define R32_GLOBAL_CONFIG   (*((vu32*)0x40001044))    // RW, global configuration
#define R8_RESET_STATUS     (*((vu8*)0x40001044))     // RO, reset status
#define  RB_RESET_FLAG      0x07                      // RO: recent reset flag
#define  RST_FLAG_SW        0x00
#define  RST_FLAG_RPOR      0x01
#define  RST_FLAG_WTR       0x02
#define  RST_FLAG_MR        0x03
//#define  RST_FLAG_GPWSM     0x04                      // RO, power on reset flag during sleep/shutdown: 0=no power on reset during sleep/shutdown, 1=power on reset occurred during sleep/shutdown
#define  RST_FLAG_GPWSM     0x05
// RB_RESET_FLAG: recent reset flag
//   000 - SR, software reset, by RB_SOFTWARE_RESET=1 @RB_WDOG_RST_EN=0
//   001 - RPOR, real power on reset
//   010 - WTR, watch-dog timer-out reset
//   011 - MR, external manual reset by RST pin input low
//   101 - GRWSM, global reset by waking under shutdown mode
//   1?? - LRW, power on reset occurred during sleep
#define R8_GLOB_ROM_CFG     R8_RESET_STATUS           // RWA, flash ROM configuration, SAM
#define  RB_ROM_CODE_OFS    0x10                      // RWA, code offset address selection in Flash ROM: 0=start address 0x000000, 1=start address 0x040000
#define  RB_ROM_CTRL_EN     0x20                      // RWA, enable flash ROM control interface enable: 0=disable access, 1=enable access control register
#define  RB_ROM_DATA_WE     0x40                      // RWA, enable flash ROM data & code area being erase/write: 0=all writing protect, 1=enable data area program and erase
#ifdef CH570_CH572
#define  RB_ROM_CODE_WE     0xC0                      // RWA, enable flash ROM code area being erase/write: 0=code writing protect, 1=enable code area program and erase
#else
#define  RB_ROM_CODE_WE     0x80                      // RWA, enable flash ROM code area being erase/write: 0=code writing protect, 1=enable code area program and erase
#endif
#define R8_GLOB_CFG_INFO    (*((vu8*)0x40001045))     // RO, global configuration information and status
#define  RB_CFG_ROM_READ    0x01                      // RO, indicate protected status of Flash ROM code and data: 0=reading protect, 1=enable read by external programmer
#define  RB_CFG_RESET_EN    0x04                      // RO, manual reset input enable status
#define  RB_CFG_BOOT_EN     0x08                      // RO, boot-loader enable status
#define  RB_CFG_DEBUG_EN    0x10                      // RO, debug enable status
#define  RB_BOOT_LOADER     0x20                      // RO, indicate boot loader status: 0=application status (by software reset), 1=boot loader status
#define R8_RST_WDOG_CTRL    (*((vu8*)0x40001046))     // RWA, reset and watch-dog control, SAM
#define  RB_SOFTWARE_RESET  0x01                      // WA/WZ, global software reset, high action, auto clear
#define  RB_WDOG_RST_EN     0x02                      // RWA, enable watch-dog reset if watch-dog timer overflow: 0=as timer only, 1=enable reset if timer overflow
#define  RB_WDOG_INT_EN     0x04                      // RWA, watch-dog timer overflow interrupt enable: 0=disable, 1=enable
#define  RB_WDOG_INT_FLAG   0x10                      // RW1, watch-dog timer overflow interrupt flag, cleared by RW1 or reload watch-dog count or __SEV(Send-Event)
#define R8_GLOB_RESET_KEEP  (*((vu8*)0x40001047))     // RW, value keeper during global reset

/*System: Miscellaneous Control register */
#define R32_MISC_CTRL       (*((vu32*)0x40001048))    // RWA, miscellaneous control register
#define R8_PLL_CONFIG       (*((vu8*)0x4000104B))     // RWA, PLL configuration control, SAM
#define  RB_PLL_CFG_DAT     0x7F                      // RWA, PLL configuration control, SAM
#define  RB_FLASH_IO_MOD    0x80                      // RWA, flash ROM interface mode, SAM

/* System: 32MHz oscillator control register */
#define R32_OSC32M_CTRL     (*((vu32*)0x4000104C))    // RWA, 32MHz oscillator control, SAM
#define R8_XT32M_TUNE       (*((vu8*)0x4000104E))     // RWA, external 32MHz oscillator tune control, SAM
#define  RB_XT32M_I_BIAS    0x03                      // RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current
#define  RB_XT32M_C_LOAD    0x70                      // RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF

/* System: oscillator frequency calibration register */
#define R32_OSC_CALIB       (*((vu32*)0x40001050))    // RWA, oscillator frequency calibration, SAM
#define R16_OSC_CAL_CNT     (*((vu16*)0x40001050))    // RO, system clock count value for 32KHz 5 cycles
#define  RB_OSC_CAL_CNT     0x3FFF                    // RO, system clock count value for LSI multi-cycles
#define  RB_OSC_CAL_OV_CLR  0x4000                    // RW1, indicate R8_OSC_CAL_OV_CNT not zero, set 1 to clear R8_OSC_CAL_OV_CNT
#define  RB_OSC_CAL_IF      0x8000                    // RW1, interrupt flag for oscillator capture end, set 1 to clear
#define R8_OSC_CAL_OV_CNT   (*((vu8*)0x40001052))     // RO, oscillator frequency calibration overflow times
#define R8_OSC_CAL_CTRL     (*((vu8*)0x40001053))     // RWA, oscillator frequency calibration control, SAM
#define  RB_OSC_CNT_TOTAL   0x07                      // RWA, total cycles mode for oscillator capture
// RB_OSC_CNT_TOTAL: select total cycles for oscillator capture
//    000: 1
//    001: 2
//    010: 4
//    011: 32
//    100: 64
//    101: 128
//    110: 1024
//    111: 2047
#define  RB_OSC_CNT_HALT    0x08                      // RO, calibration counter halt status: 0=counting, 1=halt for reading count value
#define  RB_OSC_CAL_IE      0x10                      // RWA, interrupt enable for oscillator capture end
#define  RB_OSC_CNT_EN      0x20                      // RWA, calibration counter enable
#define  RB_OSC_CNT_END     0x40                      // RWA, select oscillator capture end mode: 0=normal, 1=append 2 cycles
#define  RB_CNT_CLR         0x80                      // RWA,  reset RB_OSC_CAL_CNT

/* System: ADC and Touch-key register */
#ifdef CH570_CH572
/*system: CMP*/
#define R32_CMP_CTRL        (*((vu32*)0x40001054))    // RW, configuration for comparator, 
#define R8_CMP_CTRL_0       (*((vu8*)0x40001054))     // RW, configuration for comparator0, 
#define  RB_CMP_EN          0x01                      // RW, enable comparators    
#define  RB_CMP_CAP         0x02                      // RW, connect COMP_output to be TIM_cap1_input
#define  RB_CMP_SW          0x0C                      // RW, [0]comparator -channel input sel:1=PA7,0=PA3 ; [1]comparator +channel input sel: 1=COMP_VERF,0=PA2
#define  RB_CMP_NREF_LEVEL  0xF0                      // RW, comparator negative end point Vref sel:1111=800mv,0000=50mv       
#define R8_CMP_CTRL_1       (*((vu8*)0x40001055))     // RW, configuration for comparator1, 
#define  RB_CMP_IE          0x01                      // RW, comparator interupt enable 
#define  RB_CMP_OUT_SEL     0x0C                      // RW, comparator output sel:11=rise edge,10=fall edge,01=low,00=high 
#define R8_CMP_CTRL_2       (*((vu8*)0x40001056))     // RW, configuration for comparator2, 
#define  RB_CMP_IF          0x01                      // RW1Z, comparator interupt flag     
#define R8_CMP_CTRL_3       (*((vu8*)0x40001057))     // RW, configuration for comparator3,
#define  RB_CMP_REAL_SIG    0x01                      // RO, comparator current real siginal 
#define  RB_APR_OUT_CMP     0x02                      // RO, comparator current output siginal 
#define R32_SAFE_ACCESS_SIG2  (*((vu32*)0x40001058))  // RO, safe accessing sign register2,
#define  RB_SAFE_AC_DIS     0x00100000                // RO, safe register auto disable flag,1=disable safe access auto off; 0=enable safe access auto off
#define  RB_RD_PROTECT      0x00200000                // RO, flash read protecet flag,1=enable read project; 0=disable read project
#define  RB_MANU_CFG_LOCK   0x00400000                // RO, vendor configuration word lock flag,1=locked; 0= not locked
#define  RB_FLASH_HALTED    0x00800000                // RO, 2wire flash prohibited operation flag,1=prohibit operation; 0=allow operation
#define  RB_FUN_MODE        0x07000000                // RO, function enable
/* KEYSCAN register */
#define R16_KEY_SCAN_CTRL    (*((vu16*)0x40001064))   // KEY SCAN control register
#define  RB_SCAN_START_EN   0x0001                    // RW, start key scan enable,1=enable 0=disable
#define  RB_SCAN_CNT_END    0x000E                    // RW, set the times of the same key_scan value 
#define  RB_SCAN_CLK_DIV    0x00F0                    // RW, divider value of scanning clock
#define  RB_PIN_SCAN_EN     0x1F00                    // RW, select which pin could be scaned, 1=enable 0=disable
#define  RB_SCAN_1END_WAKE_EN    0x2000               // RW, wake up chip after 1 round of key scanning, 1=enable 0=disable 
#define  RB_CLR_WAKEUP_EN   0x4000                    // RW, claer wake_up siginal after chip wakeing up, 1=enable 0=disable 
#define R8_KEY_SCAN_INT_EN (*((vu8*)0x40001066))      // KEY SCAN interupt enable register
#define  RB_KEY_PRESSED_IE  0x01                      // RW, detect key pressed interupt enable                  
#define  RB_SCAN_1END_IE    0x02                      // RW, key scan 1 round end interupt enable
#define R8_KEY_SCAN_INT_FLAG (*((vu8*)0x40001067))    // KEY SCAN interupt flag register 
#define  RB_KEY_PRESSED_IF  0x01                      // RW1, detect key pressed flag enable                   
#define  RB_SCAN_1END_IF    0x02                      // RW1, key scan 1 round end flag enable
#define R32_KEY_SCAN_NUMB  (*((vu32*)0x40001068))     // SCAN_KEY number address now register
#define  RB_KEY_SCAN_CNT    0x700000                  // current SCAN_KEY times
#define  RB_KEY_SCAN_NUMB   0x0FFFFF                  // SCAN_KEY number address now
#else
#define R32_ADC_CTRL        (*((vu32*)0x40001058))    // RW, ADC control
#define R8_ADC_CHANNEL      (*((vu8*)0x40001058))     // RW, ADC input channel selection
#define  RB_ADC_CH_INX      0x0F                      // RW, ADC input channel index
#define R8_ADC_CFG          (*((vu8*)0x40001059))     // RW, ADC configure
#define  RB_ADC_POWER_ON    0x01                      // RW, ADC power control: 0=power down, 1=power on
#define  RB_ADC_BUF_EN      0x02                      // RW, ADC input buffer enable 
#define  RB_ADC_DIFF_EN     0x04                      // RW, ADC input channel mode: 0=single-end, 1=differnetial
#define  RB_ADC_OFS_TEST    0x08                      // RW, enable ADC offset test mode: 0=normal mode, 1=short AIN7 to test offset
#define  RB_ADC_PGA_GAIN    0x30                      // RW, set ADC input PGA gain: 00=-12dB, 01=-6dB, 10=0dB, 11=6dB
#define  RB_ADC_CLK_DIV     0xC0                      // RW, select ADC clock frequency: 00=3.2MHz, 01=8MHz, 10=5.33MHz, 11=4MHz
#define R8_ADC_CONVERT      (*((vu8*)0x4000105A))     // RW, ADC convert control
#define  RB_ADC_START       0x01                      // RW, ADC convert start control: 0=stop ADC convert, 1=start an ADC convert, auto clear
#define  RB_ADC_PGA_GAIN2   0x02                      // RW, ADC gain direction, must be 0 when using TS
#define  RB_ADC_EOC_X       0x80                      // RO, end of ADC conversion flag
#define R8_TEM_SENSOR       (*((vu8*)0x4000105B))     // RW, temperature sensor control
#define  RB_TEM_SEN_PWR_ON  0x80                      // RW, temperature sensor power control: 0=power down, 1=power on
#define R32_ADC_DATA        (*((vu32*)0x4000105C))    // RO, ADC data and status
#define R16_ADC_DATA        (*((vu16*)0x4000105C))    // RO, ADC data
#define  RB_ADC_DATA        0x0FFF                    // RO, ADC conversion data
#define R8_ADC_INT_FLAG     (*((vu8*)0x4000105E))     // RO, ADC interrupt flag register
#define  RB_ADC_IF_EOC      0x80                      // RO, ADC conversion interrupt flag: 0=free or converting, 1=end of conversion, interrupt action, auto ADC or write R8_ADC_CONVERT or write R8_TKEY_CONVERT to clear flag
#define R32_TKEY_CTRL       (*((vu8*)0x40001054))     // RW, Touchkey control
#define R8_TKEY_COUNT       (*((vu8*)0x40001054))     // RW, Touchkey charge and discharge count
#define  RB_TKEY_CHARG_CNT  0x1F                      // RW, Touchkey charge count
#define  RB_TKEY_DISCH_CNT  0xE0                      // RW, Touchkey discharge count
#define R8_TKEY_CONVERT     (*((vu8*)0x40001056))     // RW, Touchkey convert control
#define  RB_TKEY_START      0x01                      // RW, Touchkey convert start control: 0=stop Touchkey convert, 1=start a Touchkey convert, auto clear
#define R8_TKEY_CFG         (*((vu8*)0x40001057))     // RW, Touchkey configure
#define  RB_TKEY_PWR_ON     0x01                      // RW, Touchkey power on: 0=power down, 1=power on
#define  RB_TKEY_CURRENT    0x02                      // RW, Touchkey charge current selection: 0=35uA, 1=70uA
#define  RB_TKEY_DRV_EN     0x04                      // RW, Touchkey drive shield enable
#define  RB_TKEY_PGA_ADJ    0x08                      // RW, ADC input PGA speed selection: 0=slow, 1=fast
#define  RB_TKEY_DMA_EN     0x10                      // RW, Touchkey DMA enable
#define  RB_TKEY_AUTO_EN    0x20                      // RW, Touchkey auto-trigger enable
#define  RB_TKEY_RAND_EN    0x40                      // RW, Touchkey random trigger enable
#define R32_ADC_DMA_CTRL    (*((vu32*)0x40001060))    // RW, ADC DMA control
#define R8_ADC_CTRL_DMA     (*((vu8*)0x40001061))     // RW, ADC DMA control
#define  RB_ADC_DMA_ENABLE  0x01                      // RW, ADC DMA enable
#define  RB_ADC_DMA_LOOP    0x04                      // RW, ADC DMA address loop enable
#define  RB_ADC_IE_DMA_END  0x08                      // RW, enable interrupt for ADC DMA completion
#define  RB_ADC_IE_EOC      0x10                      // RW, enable interrupt for end of ADC conversion
#define  RB_ADC_CONT_EN     0x40                      // RW, enable contineous conversion ADC
#define  RB_ADC_AUTO_EN     0x80                      // RW, enable auto continuing ADC for DMA
#define R8_ADC_DMA_IF       (*((vu8*)0x40001062))     // RW1, ADC interrupt flag
#define  RB_ADC_IF_DMA_END  0x08                      // RW1, interrupt flag for ADC DMA completion
#define  RB_ADC_IF_END_ADC  0x10                      // RW1, interrupt flag for end of ADC conversion, DMA for auto ADC or write R8_ADC_CONVERT to clear flag
#define R8_ADC_AUTO_CYCLE   (*((vu8*)0x40001063))     // RW, auto ADC cycle value, unit is 16 Fsys
#define R32_ADC_DMA_NOW     (*((vu32*)0x40001064))    // RW, ADC DMA current address
#define R16_ADC_DMA_NOW     (*((vu16*)0x40001064))    // RW, ADC DMA current address
#define R32_ADC_DMA_BEG     (*((vu32*)0x40001068))    // RW, ADC DMA begin address
#define R16_ADC_DMA_BEG     (*((vu16*)0x40001068))    // RW, ADC DMA begin address
#define R32_ADC_DMA_END     (*((vu32*)0x4000106C))    // RW, ADC DMA end address
#define R16_ADC_DMA_END     (*((vu16*)0x4000106C))    // RW, ADC DMA end address
#endif

/* System: GPIO interrupt control register */
#define R32_GPIO_INT_EN     (*((vu32*)0x40001090))    // RW, GPIO interrupt enable
#define R16_PA_INT_EN       (*((vu16*)0x40001090))    // RW, GPIO PA interrupt enable
#define R16_PB_INT_EN       (*((vu16*)0x40001092))    // RW, GPIO PB interrupt enable
#define R32_GPIO_INT_MODE   (*((vu32*)0x40001094))    // RW, GPIO interrupt mode: 0=level action, 1=edge action
#define R16_PA_INT_MODE     (*((vu16*)0x40001094))    // RW, GPIO PA interrupt mode: 0=level action, 1=edge action
#define R16_PB_INT_MODE     (*((vu16*)0x40001096))    // RW, GPIO PB interrupt mode: 0=level action, 1=edge action
#define R32_GPIO_INT_IF     (*((vu32*)0x4000109C))    // RW1, GPIO interrupt flag
#define R16_PA_INT_IF       (*((vu16*)0x4000109C))    // RW1, GPIO PA interrupt flag
#define R16_PB_INT_IF       (*((vu16*)0x4000109E))    // RW1, GPIO PB interrupt flag

/* GPIO PA register */
#define R32_PA_DIR          (*((vu32*)0x400010A0))    // RW, GPIO PA I/O direction: 0=in, 1=out
#define R32_PA_PIN          (*((vu32*)0x400010A4))    // RO, GPIO PA input
#define R32_PA_OUT          (*((vu32*)0x400010A8))    // RW, GPIO PA output
#define R32_PA_CLR          (*((vu32*)0x400010AC))    // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R32_PA_PU           (*((vu32*)0x400010B0))    // RW, GPIO PA pullup resistance enable
#define R32_PA_PD_DRV       (*((vu32*)0x400010B4))    // RW, PA pulldown for input or PA driving capability for output
#define R32_PA_SET          (*((vu32*)0x400010B8))    // RW, PA set high for output ,1=set output high,0=IDLE

#ifndef CH570_CH572
/* GPIO PB register */
#define R32_PB_DIR          (*((vu32*)0x400010C0))    // RW, GPIO PB I/O direction: 0=in, 1=out
#define R32_PB_PIN          (*((vu32*)0x400010C4))    // RO, GPIO PB input
#define R32_PB_OUT          (*((vu32*)0x400010C8))    // RW, GPIO PB output
#define R32_PB_CLR          (*((vu32*)0x400010CC))    // WZ, GPIO PB clear output: 0=keep, 1=clear
#define R32_PB_PU           (*((vu32*)0x400010D0))    // RW, GPIO PB pullup resistance enable
#define R32_PB_PD_DRV       (*((vu32*)0x400010D4))    // RW, PB pulldown for input or PB driving capability for output
#define R32_PB_SET          (*((vu32*)0x400010D8))    // RW, PB set high for output ,1=set output high,0=IDLE
#endif

#define PA0                 (0x00000001)              /*!< Pin 0 selected */
#define PA1                 (0x00000002)              /*!< Pin 1 selected */
#define PA2                 (0x00000004)              /*!< Pin 2 selected */
#define PA3                 (0x00000008)              /*!< Pin 3 selected */
#define PA4                 (0x00000010)              /*!< Pin 4 selected */
#define PA5                 (0x00000020)              /*!< Pin 5 selected */
#define PA6                 (0x00000040)              /*!< Pin 6 selected */
#define PA7                 (0x00000080)              /*!< Pin 7 selected */
#define PA8                 (0x00000100)              /*!< Pin 8 selected */
#define PA9                 (0x00000200)              /*!< Pin 9 selected */
#define PA10                (0x00000400)              /*!< Pin 10 selected */
#define PA11                (0x00000800)              /*!< Pin 11 selected */
#define PA12                (0x00001000)              /*!< Pin 12 selected */
#define PA13                (0x00002000)              /*!< Pin 13 selected */
#define PA14                (0x00004000)              /*!< Pin 14 selected */
#define PA15                (0x00008000)              /*!< Pin 15 selected */

#ifndef CH570_CH572
#define PB                  (0x80000000)              /* Bit mask to indicate bank B */
#define PB0                 (0x80000001)              /*!< Pin 0 selected */
#define PB1                 (0x80000002)              /*!< Pin 1 selected */
#define PB2                 (0x80000004)              /*!< Pin 2 selected */
#define PB3                 (0x80000008)              /*!< Pin 3 selected */
#define PB4                 (0x80000010)              /*!< Pin 4 selected */
#define PB5                 (0x80000020)              /*!< Pin 5 selected */
#define PB6                 (0x80000040)              /*!< Pin 6 selected */
#define PB7                 (0x80000080)              /*!< Pin 7 selected */
#define PB8                 (0x80000100)              /*!< Pin 8 selected */
#define PB9                 (0x80000200)              /*!< Pin 9 selected */
#define PB10                (0x80000400)              /*!< Pin 10 selected */
#define PB11                (0x80000800)              /*!< Pin 11 selected */
#define PB12                (0x80001000)              /*!< Pin 12 selected */
#define PB13                (0x80002000)              /*!< Pin 13 selected */
#define PB14                (0x80004000)              /*!< Pin 14 selected */
#define PB15                (0x80008000)              /*!< Pin 15 selected */
#define PB16                (0x80010000)              /*!< Pin 16 selected */
#define PB17                (0x80020000)              /*!< Pin 17 selected */
#define PB18                (0x80040000)              /*!< Pin 18 selected */
#define PB19                (0x80080000)              /*!< Pin 19 selected */
#define PB20                (0x80100000)              /*!< Pin 20 selected */
#define PB21                (0x80200000)              /*!< Pin 21 selected */
#define PB22                (0x80400000)              /*!< Pin 22 selected */
#define PB23                (0x80800000)              /*!< Pin 23 selected */
#endif
#define P_All               (0xFFFFFFFF)              /*!< All pins selected */

