monte-monte/ch32v003fun/ch32fun/ch5xxhw.h
typedef enum
{
	GPIO_ModeIN_Floating,
	GPIO_ModeIN_PU,
	GPIO_ModeIN_PD,
	GPIO_ModeOut_PP_5mA,
	GPIO_ModeOut_PP_20mA,
} GPIOModeTypeDef;

/* General Purpose I/O */
typedef enum
{
	GPIO_CFGLR_IN_FLOAT = GPIO_ModeIN_Floating,
	GPIO_CFGLR_IN_PUPD = GPIO_ModeIN_PU, // is most common
	GPIO_CFGLR_IN_PU = GPIO_ModeIN_PU,
	GPIO_CFGLR_IN_PD = GPIO_ModeIN_PD, // to suppress the -Wswitch warning
	GPIO_CFGLR_OUT_10Mhz_PP = GPIO_ModeOut_PP_20mA,
	GPIO_CFGLR_OUT_2Mhz_PP = GPIO_ModeOut_PP_5mA,
	GPIO_CFGLR_OUT_50Mhz_PP = GPIO_ModeOut_PP_20mA,
} GPIO_CFGLR_PIN_MODE_Typedef;

/* System: Flash ROM control register */
#define R32_FLASH_DATA      (*((vu32*)0x40001800))    // RO/WO, flash ROM data
#define R32_FLASH_CONTROL   (*((vu32*)0x40001804))    // RW, flash ROM control, byte1 and byte3 need RWA
#define R8_FLASH_DATA       (*((vu8*)0x40001804))     // RO/WO, flash ROM data buffer
#define R8_FLASH_SCK        (*((vu8*)0x40001805))     // RW, flash ROM sck time config
#define R8_FLASH_CTRL       (*((vu8*)0x40001806))     // RW, flash ROM access control
#define R8_FLASH_CFG        (*((vu8*)0x40001807))     // RWA, flash ROM access config, SAM

#ifdef CH570_CH572
/* Timer1 register */
#define R32_TMR_CONTROL    (*((vu32*)0x40002400))     // RW, TMR control
#define R8_TMR_CTRL_MOD    (*((vu8*)0x40002400))      // RW, TMR mode control
#define R8_TMR_CTRL_DMA    (*((vu8*)0x40002401))      // RW, TMR DMA control
#define R8_TMR_INTER_EN    (*((vu8*)0x40002402))      // RW, TMR interrupt enable
// #define R32_TMR_STATUS     (*((vu32*)0x40002404))     // RW, TMR status
#define R8_TMR_INT_FLAG    (*((vu8*)0x40002406))      // RW1, TMR interrupt flag
#define R8_TMR_FIFO_COUNT  (*((vu8*)0x40002407))      // RO, TMR FIFO count status
#define R32_TMR_COUNT      (*((vu32*)0x40002408))     // RO, TMR current count
#define R16_TMR_COUNT      (*((vu16*)0x40002408))     // RO, TMR current count
#define R8_TMR_COUNT       (*((vu8*)0x40002408))      // RO, TMR current count
#define R32_TMR_CNT_END    (*((vu32*)0x4000240C))     // RW, TMR end count value, only low 26 bit
#define R32_TMR_FIFO       (*((vu32*)0x40002410))     // RO/WO, TMR FIFO register, only low 26 bit
#define R16_TMR_FIFO       (*((vu16*)0x40002410))     // RO/WO, TMR FIFO register
#define R8_TMR_FIFO        (*((vu8*)0x40002410))      // RO/WO, TMR FIFO register
#define R32_TMR_DMA_NOW    (*((vu32*)0x40002414))     // RW, TMR DMA current address
#define R16_TMR_DMA_NOW    (*((vu16*)0x40002414))     // RW, TMR DMA current address
#define R32_TMR_DMA_BEG    (*((vu32*)0x40002418))     // RW, TMR DMA begin address
#define R16_TMR_DMA_BEG    (*((vu16*)0x40002418))     // RW, TMR DMA begin address
#define R32_TMR_DMA_END    (*((vu32*)0x4000241C))     // RW, TMR DMA end address
#define R16_TMR_DMA_END    (*((vu16*)0x4000241C))     // RW, TMR DMA end address
/* ENCODER register */
#define R32_ENC_REG_CTRL    (*((vu32*)0x40002420))
#define R8_ENC_REG_CTRL        (*((vu8*)0x40002420))  // RW, ENCODER control register
// #define  RB_WAKEUP_CLR_EN   0x10                      // RW, clear wake_up siginal after chip wake up enable   
#define  RB_ENC_DIR         0x20                      // RO, encoder director,0=forward,1=backward  
#define  RB_RD_CLR_EN       0x08                      // RW, clear encoder count value after R32_ENC_REG_CCNT be read
#define  RB_SMS_MODE        0x06                      // RW, SMS mode value,10=T1EDGE,01=T2EDGE,11=T12EDGE
#define  RB_START_ENC_EN    0x01                      // RW, start encode enable   
#define R8_ENC_INTER_EN        (*((vu8*)0x40002421))  // RW, ENCODER interupt enable register
#define  RB_IE_DIR_DEC      0x02                      // RW, encode decrease interupt enable
#define  RB_IE_DIR_INC      0x01                      // RW, encode increase interupt enable 
#define R8_ENC_INT_FLAG        (*((vu8*)0x40002422))  // RW, ENCODER interupt flag register
#define  RB_IF_DIR_DEC      0x02                      // RWA, encode decrease interupt flag
#define  RB_IF_DIR_INC      0x01                      // RWA, encode increase interupt flag 
#define R32_ENC_REG_CEND    (*((vu32*)0x40002424))
#define R32_ENC_REG_CCNT    (*((vu32*)0x40002428))
#define BA_TMR              ((vu8*)0x40002400)        // point TMR base address
#else

/* Timer0 register */
#define R32_TMR0_CONTROL    (*((vu32*)0x40002000))    // RW, TMR0 control
#define R8_TMR0_CTRL_MOD    (*((vu8*)0x40002000))     // RW, TMR0 mode control
#define R8_TMR0_INTER_EN    (*((vu8*)0x40002002))     // RW, TMR0 interrupt enable
#define R32_TMR0_STATUS     (*((vu32*)0x40002004))    // RW, TMR0 status
#define R8_TMR0_INT_FLAG    (*((vu8*)0x40002006))     // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT  (*((vu8*)0x40002007))     // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT      (*((vu32*)0x40002008))    // RO, TMR0 current count
#define R16_TMR0_COUNT      (*((vu16*)0x40002008))    // RO, TMR0 current count
#define R8_TMR0_COUNT       (*((vu8*)0x40002008))     // RO, TMR0 current count
#define R32_TMR0_CNT_END    (*((vu32*)0x4000200C))    // RW, TMR0 end count value, only low 26 bit
#define R32_TMR0_FIFO       (*((vu32*)0x40002010))    // RO/WO, TMR0 FIFO register, only low 26 bit
#define R16_TMR0_FIFO       (*((vu16*)0x40002010))    // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO        (*((vu8*)0x40002010))     // RO/WO, TMR0 FIFO register

/* Timer1 register */
#define R32_TMR1_CONTROL    (*((vu32*)0x40002400))    // RW, TMR1 control
#define R8_TMR1_CTRL_MOD    (*((vu8*)0x40002400))     // RW, TMR1 mode control
#define R8_TMR1_CTRL_DMA    (*((vu8*)0x40002401))     // RW, TMR1 DMA control
#define R8_TMR1_INTER_EN    (*((vu8*)0x40002402))     // RW, TMR1 interrupt enable
#define R32_TMR1_STATUS     (*((vu32*)0x40002404))    // RW, TMR1 status
#define R8_TMR1_INT_FLAG    (*((vu8*)0x40002406))     // RW1, TMR1 interrupt flag
#define R8_TMR1_FIFO_COUNT  (*((vu8*)0x40002407))     // RO, TMR1 FIFO count status
#define R32_TMR1_COUNT      (*((vu32*)0x40002408))    // RO, TMR1 current count
#define R16_TMR1_COUNT      (*((vu16*)0x40002408))    // RO, TMR1 current count
#define R8_TMR1_COUNT       (*((vu8*)0x40002408))     // RO, TMR1 current count
#define R32_TMR1_CNT_END    (*((vu32*)0x4000240C))    // RW, TMR1 end count value, only low 26 bit
#define R32_TMR1_FIFO       (*((vu32*)0x40002410))    // RO/WO, TMR1 FIFO register, only low 26 bit
#define R16_TMR1_FIFO       (*((vu16*)0x40002410))    // RO/WO, TMR1 FIFO register
#define R8_TMR1_FIFO        (*((vu8*)0x40002410))     // RO/WO, TMR1 FIFO register
#define R32_TMR1_DMA_NOW    (*((vu32*)0x40002414))    // RW, TMR1 DMA current address
#define R16_TMR1_DMA_NOW    (*((vu16*)0x40002414))    // RW, TMR1 DMA current address
#define R32_TMR1_DMA_BEG    (*((vu32*)0x40002418))    // RW, TMR1 DMA begin address
#define R16_TMR1_DMA_BEG    (*((vu16*)0x40002418))    // RW, TMR1 DMA begin address
#define R32_TMR1_DMA_END    (*((vu32*)0x4000241C))    // RW, TMR1 DMA end address
#define R16_TMR1_DMA_END    (*((vu16*)0x4000241C))    // RW, TMR1 DMA end address

/* Timer2 register */
#define R32_TMR2_CONTROL    (*((vu32*)0x40002800))    // RW, TMR2 control
#define R8_TMR2_CTRL_MOD    (*((vu8*)0x40002800))     // RW, TMR2 mode control
#define R8_TMR2_CTRL_DMA    (*((vu8*)0x40002801))     // RW, TMR2 DMA control
#define R8_TMR2_INTER_EN    (*((vu8*)0x40002802))     // RW, TMR2 interrupt enable
#define R32_TMR2_STATUS     (*((vu32*)0x40002804))    // RW, TMR2 status
#define R8_TMR2_INT_FLAG    (*((vu8*)0x40002806))     // RW1, TMR2 interrupt flag
#define R8_TMR2_FIFO_COUNT  (*((vu8*)0x40002807))     // RO, TMR2 FIFO count status
#define R32_TMR2_COUNT      (*((vu32*)0x40002808))    // RO, TMR2 current count
#define R16_TMR2_COUNT      (*((vu16*)0x40002808))    // RO, TMR2 current count
#define R8_TMR2_COUNT       (*((vu8*)0x40002808))     // RO, TMR2 current count
#define R32_TMR2_CNT_END    (*((vu32*)0x4000280C))    // RW, TMR2 end count value, only low 26 bit
#define R32_TMR2_FIFO       (*((vu32*)0x40002810))    // RO/WO, TMR2 FIFO register, only low 26 bit
#define R16_TMR2_FIFO       (*((vu16*)0x40002810))    // RO/WO, TMR2 FIFO register
#define R8_TMR2_FIFO        (*((vu8*)0x40002810))     // RO/WO, TMR2 FIFO register
#define R32_TMR2_DMA_NOW    (*((vu32*)0x40002814))    // RW, TMR2 DMA current address
#define R16_TMR2_DMA_NOW    (*((vu16*)0x40002814))    // RW, TMR2 DMA current address
#define R32_TMR2_DMA_BEG    (*((vu32*)0x40002818))    // RW, TMR2 DMA begin address
#define R16_TMR2_DMA_BEG    (*((vu16*)0x40002818))    // RW, TMR2 DMA begin address
#define R32_TMR2_DMA_END    (*((vu32*)0x4000281C))    // RW, TMR2 DMA end address
#define R16_TMR2_DMA_END    (*((vu16*)0x4000281C))    // RW, TMR2 DMA end address

/* Timer3 register */
#define R32_TMR3_CONTROL    (*((vu32*)0x40002C00))    // RW, TMR3 control
#define R8_TMR3_CTRL_MOD    (*((vu8*)0x40002C00))     // RW, TMR3 mode control
#define R8_TMR3_INTER_EN    (*((vu8*)0x40002C02))     // RW, TMR3 interrupt enable
#define R32_TMR3_STATUS     (*((vu32*)0x40002C04))    // RW, TMR3 status
#define R8_TMR3_INT_FLAG    (*((vu8*)0x40002C06))     // RW1, TMR3 interrupt flag
#define R8_TMR3_FIFO_COUNT  (*((vu8*)0x40002C07))     // RO, TMR3 FIFO count status
#define R32_TMR3_COUNT      (*((vu32*)0x40002C08))    // RO, TMR3 current count
#define R16_TMR3_COUNT      (*((vu16*)0x40002C08))    // RO, TMR3 current count
#define R8_TMR3_COUNT       (*((vu8*)0x40002C08))     // RO, TMR3 current count
#define R32_TMR3_CNT_END    (*((vu32*)0x40002C0C))    // RW, TMR3 end count value, only low 26 bit
#define R32_TMR3_FIFO       (*((vu32*)0x40002C10))    // RO/WO, TMR3 FIFO register, only low 26 bit
#define R16_TMR3_FIFO       (*((vu16*)0x40002C10))    // RO/WO, TMR3 FIFO register
#define R8_TMR3_FIFO        (*((vu8*)0x40002C10))     // RO/WO, TMR3 FIFO register

