monte-monte/ch32v003fun/ch32fun/ch5xxhw.h
/* I2C register */
#define R16_I2C_CTRL1       (*((vu16*)0x40004800))    // RW, I2C control 1
#define R16_I2C_CTRL2       (*((vu16*)0x40004804))    // RW, I2C control 2
#define R16_I2C_OADDR1      (*((vu16*)0x40004808))    // RW, I2C own address register 1
#define R16_I2C_OADDR2      (*((vu16*)0x4000480C))    // RW, I2C own address register 2
#define R16_I2C_DATAR       (*((vu16*)0x40004810))    // RW, I2C data register
#define R16_I2C_STAR1       (*((vu16*)0x40004814))    // R0, I2C stauts register 1
#define R16_I2C_STAR2       (*((vu16*)0x40004818))    // R0, I2C status register 2
// #define R8_I2C_PEC          (*((vu8*) 0x40004819))    // R0, I2C Packet error checking register 
#define R16_I2C_CKCFGR      (*((vu16*)0x4000481C))    // RW, I2C clock control register
#define R16_I2C_RTR         (*((vu16*)0x40004820))    // RW, I2C trise register

/* I2C register address offset and bit define */
#define BA_I2C              ((vu8*)0x40004800)        // point I2C base address
#define I2C_CTRL1           0
#define  RB_I2C_PE          0x0001                    // RW, Peripheral enable
#define  RB_I2C_SMBUS       0x0002                    // RW, SMBUS mode: 0=I2C mode, 1=SMBUS mode
#define  RB_I2C_SMBTYPE     0x0008                    // RW, SMBus type: 0=Device, 1=Host
#define  RB_I2C_EBARP       0x0010                    // RW, ARP enable
#define  RB_I2C_ENPEC       0x0020                    // RW, PEC ebable
#define  RB_I2C_ENGC        0x0040                    // RW, General call enable
#define  RB_I2C_NOSTRETCH   0x0080                    // RW, Clock stretching disable (Slave mode)
#define  RB_I2C_START       0x0100                    // RW, Start generation: master mode: 0=no start, 1=repeated start; slave mode: 0=no start, 1=start at bus free
#define  RB_I2C_STOP        0x0200                    // RW, Stop generation: master mode: 0=no stop, 1=stop after the current byte transfer or after the current Start condition is sent; slave mode: 0=no stop, 1=Release the SCL and SDA lines after the current byte transfer
#define  RB_I2C_ACK         0x0400                    // RW, Acknowledge enable
#define  RB_I2C_POS         0x0800                    // RW, Acknowledge/PEC Position (for data reception)
#define  RB_I2C_PEC         0x1000                    // RW, Packet error checking: 0=No PEC transfer, 1=PEC transfer (in Tx or Rx mode)
#define  RB_I2C_ALERT       0x2000                    // RW, SMBus alert: 0=Releases SMBA pin high, 1=Drives SMBA pin low.
#define  RB_I2C_SWRST       0x8000                    // RW, Software reset
#define I2C_CTRL2           4
#define  RB_I2C_FREQ        0x003F                    // RW, Peripheral clock frequency, The minimum allowed frequency is 2 MHz,the maximum frequency is 36 MHz
#define  RB_I2C_ITERREN     0x0100                    // RW, Error interrupt enable
#define  RB_I2C_ITEVTEN     0x0200                    // RW, Event interrupt enable
#define  RB_I2C_ITBUFEN     0x0400                    // RW, Buffer interrupt enable
#define I2C_OADDR1          8
#define  RB_I2C_ADD0        0x0001                    // RW, bit0 of address in 10-bit addressing mode
#define  RB_I2C_ADD7_1      0x00FE                    // RW, bit[7:1] of address
#define  RB_I2C_ADD9_8      0x0300                    // RW, bit[9:8] of address in 10-bit addressing mode
#define  RB_I2C_MUST1       0x4000                    // RW, Should always be kept at 1
#define  RB_I2C_ADDMODE     0x8000                    // RW, Addressing mode (slave mode): 0=7-bit slave address, 1=10-bit slave address
#define I2C_OADDR2          12
#define  RB_I2C_ENDUAL      0x0001                    // RW, Dual addressing mode enable
#define  RB_I2C_ADD2        0x00FE                    // RW, bit[7:1] of address2
#define I2C_DATAR           16              
#define I2C_STAR1           20
#define  RB_I2C_SB          0x0001                    // RW0, Start bit flag (Master mode)
#define  RB_I2C_ADDR        0x0002                    // RW0, Address sent (master mode)/matched (slave mode) flag
#define  RB_I2C_BTF         0x0004                    // RO, Byte transfer finished flag
#define  RB_I2C_ADD10       0x0008                    // RO, 10-bit header sent flag (Master mode)
#define  RB_I2C_STOPF       0x0010                    // RO, Stop detection flag (slave mode)
#define  RB_I2C_RxNE        0x0040                    // RO, Data register not empty flag (receivers)
#define  RB_I2C_TxE         0x0080                    // RO, Data register empty flag (transmitters)
#define  RB_I2C_BERR        0x0100                    // RW0, Bus error flag
#define  RB_I2C_ARLO        0x0200                    // RW0, Arbitration lost flag (master mode)
#define  RB_I2C_AF          0x0400                    // RW0, Acknowledge failure flag
#define  RB_I2C_OVR         0x0800                    // RW0, Overrun/Underrun flag
#define  RB_I2C_PECERR      0x1000                    // RW0, PEC Error flag in reception
#define  RB_I2C_TIMEOUT     0x4000                    // RW0, Timeout or Tlow error flag
#define  RB_I2C_SMBALERT    0x8000                    // RW0, SMBus alert flag
#define I2C_STAR2           24
#define  RB_I2C_MSL         0x0001                    // RO, Mode statu: 0=Slave mode, 1=Master mode
#define  RB_I2C_BUSY        0x0002                    // RO, Bus busy flag
#define  RB_I2C_TRA         0x0004                    // RO, Trans flag: 0=data bytes received, 1=data bytes transmitted
#define  RB_I2C_GENCALL     0x0010                    // RO, General call address (Slave mode) received flag
#define  RB_I2C_SMBDEFAULT  0x0020                    // RO, SMBus device default address (Slave mode) received flag
#define  RB_I2C_SMBHOST     0x0040                    // RO, SMBus host header (Slave mode) received flag
#define  RB_I2C_DUALF       0x0080                    // RO, Dual flag (Slave mode): 0=Received address matched with OAR1, 1=Received address matched with OAR2
#define  RB_I2C_PECX        0xFF00                    // RO, Packet error checking register
#define I2C_CKCFGR          28
#define  RB_I2C_CCR         0x0FFF                    // RW, Controls the SCL clock in Fm/Sm mode (Master mode)
#define  RB_I2C_DUTY        0x4000                    // RW, Fm mode duty cycle: 0=L/H=2, 1=L/H=16/9
#define  RB_I2C_F_S         0x8000                    // RW, I2C master mode selection: 0=standard mode, 1=fast mode
#define I2C_RTR             32
#define  RB_I2C_TRISE       0x003F                    // RW, Maximum rise time in Fm/Sm mode (Master mode)

#ifdef CH57x
/* PWM1/2/3/4/5/register */
#define R32_PWM_CONTROL     (*((vu32*)0x40005000))    // RW, PWM control
#define R8_PWM_OUT_EN       (*((vu8*)0x40005000))     // RW, PWM output enable control
#define R8_PWM_POLAR        (*((vu8*)0x40005001))     // RW, PWM output polarity control
#define R8_PWM_CONFIG       (*((vu8*)0x40005002))     // RW, PWM configuration
#define R8_PWM_DMA_CTRL     (*((vu8*)0x40005003))     // RW, PWM DMA control
#define R32_PWM1_3_DATA     (*((vu32*)0x40005004))    // RW, PWM1-3 data holding
#define R16_PWM1_DATA       (*((vu16*)0x40005004))    // RW, PWM1 data (16 bit) holding
#define R16_PWM2_DATA       (*((vu16*)0x40005006))    // RW, PWM2 data (16 bit) holding
#define R8_PWM1_DATA        (*((vu8*)0x40005004))     // RW, PWM1 data (8 bit) holding
#define R8_PWM2_DATA        (*((vu8*)0x40005005))     // RW, PWM2 data (8 bit) holding
#define R8_PWM3_DATA        (*((vu8*)0x40005006))     // RW, PWM3 data (8 bit) holding
#define R16_PWM3_DATA       (*((vu16*)0x40005008))    // RW, PWM3 data (16 bit) holding
#define R32_PWM4_5_DATA     (*((vu32*)0x40005010))    // RW, PWM4-5 data register
#define R16_PWM4_DATA       (*((vu16*)0x40005010))    // RW, PWM4 data (16 bit) holding
#define R16_PWM5_DATA       (*((vu16*)0x40005012))    // RW, PWM5 data (16 bit) holding
#define R8_PWM4_DATA        (*((vu8*)0x40005010))     // RW, PWM4 data (8 bit) holding
#define R8_PWM5_DATA        (*((vu8*)0x40005011))     // RW, PWM5 data (8 bit) holding
#define R8_PWM_INT_EN       (*((vu8*)0x4000500C))     // RW, PWM interrupt enable
#define  RB_PWM_IE_CYC      0x01                      // RW, enable interrupt for PWM1\2\3 cycle end
#define  RB_PWM_CYC_PRE     0x02                      // RW, select PWM cycle interrupt point: 0=after count 0xFE (0x7E for 7 bits mode...), 1=after count 0xF0 (0x70 for 7 bits mode...)
#define  RB_PWM1_IE_CYC     0x04                      // RW, enable interrupt for PWM4\5 cycle end
#define  RB_PWM_IE_FIFO     0x10                      // RW, enable interrupt for fifo count < 4
#define  RB_PWM_IE_DMA      0x20                      // RW, enable interrupt for DMA transmision end
#define  RB_PWM_IE_OVER     0x40                      // RW, enable interrupt for fifo overflow
#define R8_PWM_INT_FLAG     (*((vu8*)0x4000500D))     // RW1, PWM interrupt flag
#ifdef CH571_CH573
#define  RB_PWM_IF_CYC      0x80                      // RW1, interrupt flag for PWM1\2\3 cycle end
#else
#define  RB_PWM_IF_CYC      0x01                      // RW1, interrupt flag for PWM1\2\3 cycle end
#endif
#define  RB_PWM1_IF_CYC     0x02                      // RW1, interrupt flag for PWM4\5 cycle end
#define  RB_PWM_IF_FIFO     0x04                      // RW1, interrupt flag for fifo count < 4
#define  RB_PWM_IF_DMA      0x08                      // RW1, interrupt flag for DMA transmision end
#define  RB_PWM_IF_OVER     0x10                      // RW1, interrupt flag for fifo overflow
#define R16_PWM_CYC_VALUE  (*((vu16*)0x40005014))     // RW, PWM1\2\3 cycle value for 16bit
#define R16_PWM_CYC1_VALUE   (*((vu16*)0x40005016))   // RW, PWM4\5 cycle value for 16bit
#define R16_PWM_CLOCK_DIV   (*((vu16*)0x40005018))    // RW, PWM clock division
#define R32_PWM_DMA_NOW     (*((vu32*)0x4000501C))    // RW, PWM DMA addr for now
#define R32_PWM_DMA_BEG     (*((vu32*)0x40005020))    // RW, PWM DMA addr of begining
#define R32_PWM_DMA_END     (*((vu32*)0x40005024))    // RW, PWM DMA addr of end

