monte-monte/ch32v003fun/ch32fun/ch5xxhw.h
#define R8_UH_TX_CTRL       R8_UEP3_CTRL              // host transmittal endpoint control
#define  RB_UH_T_TOG        0x40      // prepared data toggle flag of host transmittal (SETUP/OUT): 0=DATA0, 1=DATA1
#define  RB_UH_T_AUTO_TOG   0x10      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define  RB_UH_T_RES        0x01      // expected handshake response type for host transmittal (SETUP/OUT): 0=ACK (ready), 1=no response, time out from device, for isochronous transactions

#define R32_USB_EP4_CTRL    (*((vu32*)0x40008030)) // endpoint 4 control & transmittal length
#define R8_UEP4_T_LEN       (*((vu8*)0x40008030))  // endpoint 4 transmittal length
#define R8_UEP4_CTRL        (*((vu8*)0x40008032))  // endpoint 4 control

#define R32_USB_EP5_CTRL    (*((vu32*)0x40008064)) // endpoint 5 control & transmittal length
#define R8_UEP5_T_LEN       (*((vu8*)0x40008064))  // endpoint 5 transmittal length
#define R8_UEP5_CTRL        (*((vu8*)0x40008066))  // endpoint 5 control

#define R32_USB_EP6_CTRL    (*((vu32*)0x40008068)) // endpoint 6 control & transmittal length
#define R8_UEP6_T_LEN       (*((vu8*)0x40008068))  // endpoint 6 transmittal length
#define R8_UEP6_CTRL        (*((vu8*)0x4000806A))  // endpoint 6 control

#define R32_USB_EP7_CTRL    (*((vu32*)0x4000806C)) // endpoint 7 control & transmittal length
#define R8_UEP7_T_LEN       (*((vu8*)0x4000806C))  // endpoint 7 transmittal length
#define R8_UEP7_CTRL        (*((vu8*)0x4000806E))  // endpoint 7 control

#ifdef CH582_CH583
/*      USB2  */
#define R32_USB2_CONTROL    (*((vu32*)0x40008400)) // USB2 control & interrupt enable & device address
#define R8_USB2_CTRL        (*((vu8*)0x40008400))  // USB2 base control
#define R8_U2DEV_CTRL       (*((vu8*)0x40008401))  // USB2 device physical prot control
#define R8_U2HOST_CTRL      R8_U2DEV_CTRL             // USB2 host physical prot control
#define R8_USB2_INT_EN      (*((vu8*)0x40008402))  // USB2 interrupt enable
#define R8_USB2_DEV_AD      (*((vu8*)0x40008403))  // USB2 device address
#define R32_USB2_STATUS     (*((vu32*)0x40008404)) // USB2 miscellaneous status & interrupt flag & interrupt status
#define R8_USB2_MIS_ST      (*((vu8*)0x40008405))  // USB2 miscellaneous status
#define R8_USB2_INT_FG      (*((vu8*)0x40008406))  // USB2 interrupt flag
#define R8_USB2_INT_ST      (*((vu8*)0x40008407))  // USB2 interrupt status
#define R8_USB2_RX_LEN      (*((vu8*)0x40008408))  // USB2 receiving length
#define R32_USB2_BUF_MODE   (*((vu32*)0x4000840C)) // USB2 endpoint buffer mode
#define R8_U2EP4_1_MOD      (*((vu8*)0x4000840C))  // USB2 endpoint 4/1 mode
#define R8_U2EP2_3_MOD      (*((vu8*)0x4000840D))  // USB2 endpoint 2/3 mode
#define R8_U2EP567_MOD      (*((vu8*)0x4000840E))  // USB2 endpoint 5/6/7 mode
#define R8_U2H_EP_MOD       R8_U2EP2_3_MOD            // USB2 host endpoint mode
#define R16_U2EP0_DMA       (*((vu16*)0x40008410)) // USB2 endpoint 0 DMA buffer address
#define R16_U2EP1_DMA       (*((vu16*)0x40008414)) // USB2 endpoint 1 DMA buffer address
#define R16_U2EP2_DMA       (*((vu16*)0x40008418)) // USB2 endpoint 2 DMA buffer address
#define R16_U2H_RX_DMA      R16_U2EP2_DMA             // USB2 host rx endpoint buffer address
#define R16_U2EP3_DMA       (*((vu16*)0x4000841C)) // USB2 endpoint 3 DMA buffer address
#define R16_U2H_TX_DMA      R16_U2EP3_DMA             // USB2 host tx endpoint buffer address
#define R16_U2EP5_DMA       (*((vu16*)0x40008454)) // USB2 endpoint 5 DMA buffer address
#define R16_U2EP6_DMA       (*((vu16*)0x40008458)) // USB2 endpoint 6 DMA buffer address
#define R16_U2EP7_DMA       (*((vu16*)0x4000845C)) // USB2 endpoint 7 DMA buffer address
#define R32_USB2_EP0_CTRL   (*((vu32*)0x40008420)) // USB2 endpoint 0 control & transmittal length
#define R8_U2EP0_T_LEN      (*((vu8*)0x40008420))  // USB2 endpoint 0 transmittal length
#define R8_U2EP0_CTRL       (*((vu8*)0x40008422))  // USB2 endpoint 0 control
#define R32_USB2_EP1_CTRL   (*((vu32*)0x40008424)) // USB2 endpoint 1 control & transmittal length
#define R8_U2EP1_T_LEN      (*((vu8*)0x40008424))  // USB2 endpoint 1 transmittal length
#define R8_U2EP1_CTRL       (*((vu8*)0x40008426))  // USB2 endpoint 1 control
#define R8_U2H_SETUP        R8_U2EP1_CTRL             // USB2 host aux setup
#define R32_USB2_EP2_CTRL   (*((vu32*)0x40008428)) // USB2 endpoint 2 control & transmittal length
#define R8_U2EP2_T_LEN      (*((vu8*)0x40008428))  // USB2 endpoint 2 transmittal length
#define R8_U2EP2_CTRL       (*((vu8*)0x4000842A))  // USB2 endpoint 2 control
#define R8_U2H_EP_PID       R8_U2EP2_T_LEN            // USB2 host endpoint and PID
#define R8_U2H_RX_CTRL      R8_U2EP2_CTRL             // USB2 host receiver endpoint control
#define R32_USB2_EP3_CTRL   (*((vu32*)0x4000842c)) // USB2 endpoint 3 control & transmittal length
#define R8_U2EP3_T_LEN      (*((vu8*)0x4000842c))  // USB2 endpoint 3 transmittal length
#define R8_U2EP3_CTRL       (*((vu8*)0x4000842e))  // USB2 endpoint 3 control
#define R8_U2H_TX_LEN       R8_U2EP3_T_LEN            // USB2 host transmittal endpoint transmittal length
#define R8_U2H_TX_CTRL      R8_U2EP3_CTRL             // USB2 host transmittal endpoint control
#define R32_USB2_EP4_CTRL   (*((vu32*)0x40008430)) // USB2 endpoint 4 control & transmittal length
#define R8_U2EP4_T_LEN      (*((vu8*)0x40008430))  // USB2 endpoint 4 transmittal length
#define R8_U2EP4_CTRL       (*((vu8*)0x40008432))  // USB2 endpoint 4 control
#define R32_USB2_EP5_CTRL   (*((vu32*)0x40008464)) // USB2 endpoint 5 control & transmittal length
#define R8_U2EP5_T_LEN      (*((vu8*)0x40008464))  // USB2 endpoint 5 transmittal length
#define R8_U2EP5_CTRL       (*((vu8*)0x40008466))  // USB2 endpoint 5 control
#define R32_USB2_EP6_CTRL   (*((vu32*)0x40008468)) // USB2 endpoint 6 control & transmittal length
#define R8_U2EP6_T_LEN      (*((vu8*)0x40008468))  // USB2 endpoint 6 transmittal length
#define R8_U2EP6_CTRL       (*((vu8*)0x4000846A))  // USB2 endpoint 6 control
#define R32_USB2_EP7_CTRL   (*((vu32*)0x4000846C)) // USB2 endpoint 7 control & transmittal length
#define R8_U2EP7_T_LEN      (*((vu8*)0x4000846C))  // USB2 endpoint 7 transmittal length
#define R8_U2EP7_CTRL       (*((vu8*)0x4000846E))  // USB2 endpoint 7 control
#endif

#define LL_TX_POWER_MINUS_25_DBM       0x01
#define LL_TX_POWER_MINUS_20_DBM       0x02
#define LL_TX_POWER_MINUS_15_DBM       0x03
#define LL_TX_POWER_MINUS_10_DBM       0x05
#define LL_TX_POWER_MINUS_8_DBM        0x07
#define LL_TX_POWER_MINUS_5_DBM        0x0A
#define LL_TX_POWER_MINUS_3_DBM        0x0C
#define LL_TX_POWER_MINUS_1_DBM        0x10
#define LL_TX_POWER_0_DBM              0x12
#define LL_TX_POWER_1_DBM              0x15
#define LL_TX_POWER_2_DBM              0x18
#define LL_TX_POWER_3_DBM              0x1B
#define LL_TX_POWER_4_DBM              0x1F
#define LL_TX_POWER_5_DBM              0x25
#define LL_TX_POWER_6_DBM              0x2D
#define LL_TX_POWER_7_DBM              0x3B


RV_STATIC_INLINE void LSIEnable() 
{
	SYS_SAFE_ACCESS
	(
#ifdef CH570_CH572
		R8_LSI_CONFIG |= RB_CLK_LSI_PON; //turn on LSI
#else
		R8_CK32K_CONFIG &= ~(RB_CLK_OSC32K_XT | RB_CLK_XT32K_PON); // turn off LSE
		R8_CK32K_CONFIG |= RB_CLK_INT32K_PON; // turn on LSI
#endif
	);
}
RV_STATIC_INLINE void DCDCEnable()
{
#ifndef CH570_CH572 // CH570/2 has no DCDC.
	SYS_SAFE_ACCESS
	(
		R16_AUX_POWER_ADJ |= RB_DCDC_CHARGE;
		R16_POWER_PLAN |= RB_PWR_DCDC_PRE;
	);

	RTC_WAIT_TICKS(2);

	SYS_SAFE_ACCESS
	(
		R16_POWER_PLAN |= RB_PWR_DCDC_EN;
	);
#endif
}

RV_STATIC_INLINE void SleepInit()
{
	SYS_SAFE_ACCESS
	(
		R8_RTC_MODE_CTRL |= RB_RTC_TRIG_EN;  //enable RTC trigger
   		R8_SLP_WAKE_CTRL |= RB_SLP_RTC_WAKE; // enable wakeup control
	);
	//enable RTC interrupt
	NVIC->IENR[((uint32_t)(RTC_IRQn) >> 5)] = (1 << ((uint32_t)(RTC_IRQn) & 0x1F));
}

